app/Repositories/Admin/RoleRepository.php

    public function roles(): Collection
    {
        return Role::select('id', 'slug', 'name')->get();
---
select "id", "slug", "name" from "roles"

    public function paginatedRoles($request): LengthAwarePaginator
    {
        $search = $request->search;
        $option = PaginationHelper::pageQueryOptions($request);

        return Role::when($search, function ($query, $search) {
            $query->whereAny(['name', 'slug'], 'like', "%{$search}%");
        })
            ->when($request->user()->id != AdminConstants::DEFAULT_ADMIN_ID, function ($query) {
                $query->whereNot('id', AdminConstants::DEFAULT_ROLE_ID);
            })
            ->orderBy($option->column, $option->direction)
            ->paginate($option->perPage);
---
select * from "roles" order by "updated_at" desc limit 10 offset 0
select count(*) as aggregate from "roles"