app/Repositories/Admin/UserRepository.php

    public function users($request): LengthAwarePaginator
    {
        $search = $request->search;

        $option = PaginationHelper::pageQueryOptions($request);

        return User::with('role:slug,name')
            ->whereNotIn('id', [Auth::id(), AdminConstants::DEFAULT_ADMIN_ID])
            ->when($search, function ($query, $search) {
                $query->whereAny(
                    [
                        'name',
                        'email'
                    ],
                    'like',
                    "%{$search}%"
                );
            })
            ->orderBy($option->column, $option->direction)
            ->paginate($option->perPage);
---
select "slug", "name" from "roles" where "roles"."id" in (1)
select * from "users" where "id" not in (1, 1) order by "updated_at" desc limit 10 offset 0
select count(*) as aggregate from "users" where "id" not in (1, 1)