modules/Admin/Repositories/RoleRepository.php

select "id", "slug", "name" from "roles"
---
    public function roles(): Collection
    {
        return Role::select('id', 'slug', 'name')->get();

select * from "roles" order by "updated_at" desc limit 10 offset 0
select count(*) as aggregate from "roles"
---
    public function paginatedRoles(object $request): LengthAwarePaginator
    {
        $search = $request->search ?? null;
        $option = PaginationHelper::pageQueryOptions($request);

        return Role::when($search, function ($query, $search) {
            $query->whereAny(['name', 'slug'], 'like', "%{$search}%");
        })
            ->when(Auth::user()->id != AdminConstants::DEFAULT_ADMIN_ID, function ($query) {
                $query->whereNot('id', AdminConstants::DEFAULT_ROLE_ID);
            })
            ->orderBy($option->column, $option->direction)
            ->paginate($option->perPage);