modules/Admin/Repositories/UserRepository.php

select * from "users" where "id" not in (1, 1) order by "updated_at" desc limit 10 offset 0
select count(*) as aggregate from "users" where "id" not in (1, 1)
---
    public function users(object $request): LengthAwarePaginator
    {
        $search = $request->search ?? null;
        $option = PaginationHelper::pageQueryOptions($request);

        return User::with('role')
            ->whereNotIn('id', [AdminConstants::DEFAULT_ADMIN_ID])
            ->when($search, function ($query, $search) {
                $query->whereAny(
                    [
                        'name',
                        'email'
                    ],
                    'like',
                    "%{$search}%"
                );
            })
            ->orderBy($option->column, $option->direction)
            ->paginate($option->perPage);